#### Settings Members

---

|  |
| --- |
| Settings Class   Methods   Properties   See Also |

The  Settings  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from  APIObject  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Categories | Retrieves an object that provides access to all the categories contained in the Autodesk Revit application and project. |
| Public property | ElectricalSetting | Retrieves an object that provides access to all the electrical settings include voltage type, distribution system type, demand factor, wire type in the Autodesk Revit application and project. |
| Public property | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from  APIObject  .) |
| Public property | TilePatterns | Retrieves an object that provides access to the TilePattern objects in the document. |

# See Also

Settings Class

Autodesk.Revit.DB Namespace